<a href="https://colab.research.google.com/github/yahyalito/sqlwork/blob/master/Copy_of_sqlwork.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
%load_ext sql
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @None'

In [0]:
#Challenge 1
%%sql 
CREATE TABLE if not exists PC(
    Code VARCHAR ,
    model VARCHAR ,
    speed VARCHAR ,
    RAM VARCHAR ,
    HD VARCHAR ,
    CD VARCHAR ,
    Price FLOAT
);

 * sqlite://
Done.

[]

In [0]:
#Challenge 2 
%%sql 
CREATE TABLE if not exists Printer(
    code VARCHAR,
    model VARCHAR,
    speed VARCHAR,
    type VARCHAR,
    Price FLOAT
);

 * sqlite://
Done.

[]

In [0]:
#challenge 3
%%sql 
CREATE TABLE if not exists Movies(
    id VARCHAR,
    title VARCHAR,
    director VARCHAR,
    year int,
    length_minutes int
);

 * sqlite://
Done.

[]

In [0]:
#1.4 Challenges 
#Challenge 1

# Challenge 1
# Let's create a table customer with CustID with datatype Integer, LastName 
# with datatype character(25), FirstName with datatype Character(20)
#

%%sql
CREATE TABLE if not exists customer(
    CustID int,
    LastName char(25),
    FirstName char(25)
);

 * sqlite://
Done.

[]

In [0]:
# Challenge 3
# Create a table called sales that stores sales ID, customer ID, name, and address information.
# using also the appropriate data types
# 

%%sql
CREATE TABLE if not exists sales(
    sales_ID char(20),
    customer_ID char(25),
    name char(30),
    address char(30)
);

 * sqlite://
Done.

[]

In [0]:
# Challenge 4
# Create a table called employees that stores employee number, employee name, 
# department, and salary information using appropriate data types
#

%%sql
CREATE TABLE if not exists employees(
    employee_number char(30),
    employee_name char(30),
    department char(30),
    salary int
);

 * sqlite://
Done.

[]

In [6]:
# Challenge 1
# Let's create a new table called latest_players with similar fields to
# the already created Players table but specify the default value to unknown
#
%%sql
CREATE TABLE if not exists latest_players(
    id INTEGER PRIMARY KEY,
    name TEXT,
    age INTEGER DEFAULT 'Unknown',
    height REAL
);

 * sqlite://
Done.

[]

In [10]:
%%sql
CREATE TABLE if not exists latest_play(
    id int PRIMARY KEY,
    name text ,
    age int DEFAULT 'unknown',
    height REAL
    );

 * sqlite://
Done.

[]

In [12]:
# Challenge 2
# Let's create a new table called restaurants with the fields
# - name: string
# - description: text 
# - address: string, default value is unknown
# - user_id: integer
# - last_orders_at: date
# We can perform data type external research if need be
#
%%sql

CREATE TABLE if not exists restaurants(
    name char(40),
    description text ,
    address char(40) DEFAULT 'unknown',
    user_id int PRIMARY KEY,
    last_orders_at DATE
    );

 * sqlite://
Done.

[]

In [14]:
%%sql
select * from restaurants;

 * sqlite://
Done.

[]

In [15]:
# Challenge 1
# We can add a column DOB with the data type DATE to the TeamMembers table by;
# Hint: The data type comes after the column name
#

%%sql
ALTER TABLE TeamMembers ADD DOB DATE;
select * from TeamMembers

 * sqlite://
(sqlite3.OperationalError) no such table: TeamMembers
[SQL: ALTER TABLE TeamMembers ADD DOB DATE;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [16]:
%%sql
CREATE TABLE IF NOT EXISTS TeamMembers (
    id INTEGER PRIMARY KEY,
    name TEXT,
    age INTEGER DEFAULT 'Unknown',
    height REAL);

 * sqlite://
Done.

[]

In [17]:
%%sql
ALTER TABLE TeamMembers ADD DOB DATE;
select * from TeamMembers;

 * sqlite://
Done.
Done.

[]

In [19]:
%%sql
select * from Artists;

 * sqlite://
(sqlite3.OperationalError) no such table: Artists
[SQL: select * from Artists;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [20]:
%%sql
CREATE TABLE if not exists Artists(
    name text ,
    genre char(25),
    DOB DATE 
);

 * sqlite://
Done.

[]

In [21]:
# Challenge 2
# Let's now add a column STUDIO with the data type TEXT to the Artists table 
#

%%sql
ALTER TABLE Artists ADD STUDIO text;
select * from Artists;

 * sqlite://
Done.
Done.

[]

In [22]:
# Challenge 3
# We then rename the table Artists to MusicArtists
#

%%sql
ALTER TABLE Artists RENAME TO MusicArtists;

 * sqlite://
Done.

[]

In [27]:
# Challenge 1
# Lets drop the Players table from our database
#
%%sql
CREATE TABLE if not exists players(
    name text,
    age int
    
);
select * from players;

 * sqlite://
Done.
Done.

[]

In [29]:
%%sql
DROP TABLE players;

 * sqlite://
Done.

[]

In [32]:
# Challenge 2
# Lets drop the Customers table from our database 
#
%%sql
CREATE TABLE if not exists Customers(
    name text,
    age int
);

DROP TABLE Customers;
select * from Customers;

 * sqlite://
Done.
Done.
(sqlite3.OperationalError) no such table: Customers
[SQL: select * from Customers;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [34]:
# Challenge 3
# And finally truncate and drop our Artists table from our database
#
%%sql
select * from MusicArtists;

 * sqlite://
Done.

[]